</s>
<s>
<unk>
<def>
dynamometer
measuring
instrument
designed
to
measure
power
an
apparatus
for
force
or
muscular
effort
of
men
animals
the
developed
by
a
motor
that
required
operate
machinery
fault
put
pin
blame
on
crack
in
earths
crust
resulting
from
displacement
one
side
with
respect
other
equipment
failure
attributable
some
defect
circuit
loose
connection
insulation
short
etc
.
responsibility
bad
situation
event
want
lack
default
anything
fails
,
is
wanting
impairs
excellence
failing
blemish
moral
dereliction
duty
deviation
propriety
offense
less
serious
than
crime
interrupt
continuity
(
rock
strata
)
along
plane
fracture
stringer
member
squad
team
worker
who
strings
makes
provides
especially
bows
longitudinal
sleeper
streak
planking
carried
round
inside
vessel
under
beams
reverberate
have
long
continuing
effect
be
reflected
as
heat
sound
light
shock
waves
return
send
back
repel
drive
echo
reflect
resound
driven
repelled
rays
gendarmerie
french
police
group
gendarmes
collectively
body
pentacle
star
5
points
formed
straight
lines
between
pentagon
and
enclosing
another
realizable
capable
being
realized
existing
taking
place
proving
true
possible
do
tensile
relating
tension
shaped
bent
drawn
out
pertaining
extension
ductile
masterly
having
revealing
supreme
mastery
skill
suitable
characteristic
master
indicating
thorough
knowledge
superior
showing
'
s
hand
imperious
domineering
arbitrary
adumbrate
describe
roughly
briefly
give
main
summary
understand
faint
shadow
slight
representation
outline
forth
overshadow
shade
subsist
support
oneself
existence
inhere
continue
retain
certain
state
maintained
food
clothing
supported
live
provisions
feed
maintain
meddling
intrude
peoples
affairs
business
act
altering
something
secretly
improperly
meddlesome
recombination
combining
charges
transfer
electrons
gas
results
neutralization
ions
important
arising
passage
high
-
energy
particles
genes
characters
different
what
they
were
parents
combination
second
additional
time
bristle
rise
up
fear
thickly
covered
if
bristles
react
offended
angry
manner
stiff
fiber
coarse
hair
filament
natural
synthetic
swine
sharp
roundish
erect
cause
stand
hog
like
appear
standing
thick
show
defiance
indignation
portentous
momentous
ominous
significance
puffed
vanity
nature
portent
foreshadowing
ill
monstrous
prodigious
wonderful
dreadful
bounty
payment
reward
government
acts
such
catching
criminals
killing
predatory
enlisting
military
generosity
evidenced
willingness
freely
ship
british
navy
liberality
bestowing
gifts
favors
gracious
liberal
giving
munificence
which
given
generously
liberally
premium
offered
induce
enlist
into
public
service
encourage
any
branch
industry
husbandry
manufactures
coltsfoot
native
europe
but
now
nearly
cosmopolitan
used
medicinally
formerly
tufted
evergreen
perennial
herb
spikes
tiny
white
flowers
glossy
green
heart
leaves
become
coppery
maroon
purplish
fall
whose
rootstock
are
sometimes
employed
medicine
arthritis
inflammation
joint
joints
including
gout
trinity
cardinal
number
sum
three
people
considered
unit
union
persons
father
son
holy
ghost
godhead
so
all
god
substance
individuality
units
treated
ravine
deep
narrow
steep
sided
valley
running
water
hollow
usually
worn
stream
torrent
gorge
mountain
cleft
hierarchy
organization
at
ranks
administrative
dominion
authority
sacred
things
officials
disposed
organically
orders
each
subordinate
above
it
ecclesiastical
rulers
sanctimony
quality
hypocritically
devout
holiness
devoutness
scrupulous
austerity
sanctity
outward
artificial
saintliness
assumed
pretended
hypocritical
map
establish
features
details
locate
within
specific
region
chromosome
relation
known
dna
gene
sequences
diagrammatic
surface
part
mathematical
element
set
domain
function
associated
range
earth
portion
relative
position
parts
represented
represents
succession
events
states
sketch
plan
harrier
hound
resembles
foxhound
smaller
hunt
rabbits
hawks
over
meadows
marshes
prey
small
terrestrial
persistent
attacker
breed
hounds
hunting
hares
manage
charge
dispose
successful
achieve
goal
come
terms
control
direction
conduct
guide
administer
treat
handle
careful
delicate
treatment
wield
address
make
subservient
artful
bring
around
cunningly
plans
train
horse
exercise
graceful
action
direct
carry
badness
degree
undesirable
e
g
pain
weather
below
standard
expectations
ethics
decency
attribute
mischievous
children
gyre
shape
series
concentric
circles
flower
petals
circular
motion
circle
described
moving
turn
revolution
glib
marked
intellectual
depth
only
superficial
plausibility
artfully
persuasive
speech
speaking
spoken
smoothly
flippant
rapidity
fluent
voluble
poser
particularly
difficult
baffling
question
problem
person
habitually
pretends
he
not
poses
photographer
painter
sculptor
inexplicable
fact
narthex
portico
west
end
early
christian
basilica
church
vestibule
leading
nave
tall
umbelliferous
plant
front
ancient
churches
bakery
workplace
where
baked
goods
cakes
produced
sold
baking
bread
bakehouse
literary
literature
knowledgeable
about
appropriate
rather
everyday
writing
letters
learning
learned
versed
acquainted
occupied
profession
connected
medicate
impregnate
medicinal
tincture
drug
triangulation
method
determining
fixed
point
angles
two
distance
apart
useful
navigation
surveying
area
divided
triangles
length
its
measured
then
lengths
sides
can
calculated
network
face
country
survey
macho
markedly
masculine
appearance
striped
mullet
california
romanticism
impractical
romantic
ideals
attitudes
movement
art
during
late
18th
19th
centuries
celebrated
civilization
exciting
mysterious
heroic
adventure
fondness
characteristics
peculiarities
specifically
modern
aiming
effects
bald
no
conceal
lacking
most
scalp
without
usual
covering
lose
ones
head
destitute
common
top
feathers
foliage
trees
ornament
bare
literal
undisguised
fifteenth
coming
next
after
fourteenth
just
before
sixteenth
15
countable
order
consisting
fifteen
equal
divisions
thing
quotient
species
tax
upon
personal
property
laid
towns
great
vertical
dimension
stature
impressively
lofty
style
too
improbable
admit
belief
considerable
unusual
upward
comparatively
slender
diameter
lateral
extent
proportion
height
fratricide
murders
their
brother
sister
fire
injures
kills
ally
his
own
tip
tilt
extreme
pointed
indication
potential
opportunity
relatively
amount
money
services
rendered
waiter
extremity
somewhat
sharply
rounded
piece
cap
nozzle
ferrule
applied
stiffened
lining
pasted
hat
crown
form
strike
slightly
tap
present
lower
throw
incline
touch
blow
gift
fee
rasp
utter
grating
voice
uttering
irritated
tone
file
projections
rub
grate
rough
figuratively
:
harshly
offend
language
cutting
prominences
distinct
raised
oblique
stroke
punch
instead
chisel
regular
accordance
procedure
principle
belonging
engaged
legitimate
army
forces
clear
dimensions
volume
determined
geometric
formula
often
intensifiers
conforming
pattern
regularly
scheduled
times
dependable
follower
party
politics
conformed
rule
agreeable
established
law
type
customary
forms
normal
symmetrical
governed
rules
steady
uniform
course
practice
occurence
returning
stated
intervals
steadily
pursued
methodical
constituted
selected
conducted
conformity
usages
discipline
duly
authorized
permanently
organized
religious
community
has
taken
vows
poverty
chastity
obedience
been
solemnly
recognized
soldier
permanent
crisp
clearly
defined
tender
brittle
pleasantly
cold
invigorating
wrinkles
creases
smooth
pressed
folded
wrinkled
line
curling
curls
ringlets
curled
ripple
friable
condition
break
curl
nap
cloth
interweave
branches
undulate
irregularly
crape
wrinkle
rind
roasted
pork
crackling
elocution
expert
involving
gesture
reading
freeman
serf
slave
enjoys
liberty
subject
will
vassal
corporation
company
city
possessing
privileges
borough
town
right
vote
elections
elegant
refined
tasteful
behavior
suggesting
taste
ease
wealth
displaying
effortless
beauty
simplicity
execution
very
choice
hence
pleasing
good
characterized
grace
refinement
absence
every
offensive
admiration
approbation
symmetry
completeness
freedom
highly
attractive
exercising
nice
discriminating
sensitive
immortality
immortal
perpetual
life
death
exemption
annihilation
oblivion
perpetuity
merit
worthy
deserving
admirable
.,
assistance
well
desert
worth
deserved
mark
token
earn
performance
claim
deserve
sense
copulatory
copulation
tending
serving
unite
sexual
timepiece
device
keeping
clock
watch
progress
chronometer
neoplasia
pathological
process
formation
growth
tumor
development
new
material
incursion
entering
territory
large
numbers
mistake
incurring
liability
attack
penetrates
enemy
hostile
intention
temporary
invasion
harassing
inroad
raid
kindly
pleasant
motivated
sympathy
understanding
kind
kindness
humane
congenial
sympathetic
benevolent
helpful
favorable
mild
gentle
auspicious
beneficent
disposition
others
happy
oblige
omelet
beaten
eggs
egg
mixture
cooked
until
may
ham
cheese
jelly
dish
little
flour
example
retard
move
more
slowly
slower
rate
delayed
slow
subnormal
intelligence
keep
delaying
hinder
prevent
render
impede
off
postpone
retardation
delay
align
arrange
parallel
adjustment
adjust
aline
pluralism
social
diversity
racial
ethnic
cultural
groups
doctrine
reality
consists
several
basic
substances
elements
holding
benefice
plural
pluralist
living
revamp
patch
renovate
repair
restore
provide
shoe
vamp
again
reconstruct
astrolabe
sextant
observing
positions
stars
satisfy
meet
requirements
satisfied
fill
need
general
content
supply
full
far
contentment
pay
claims
deserts
due
answer
discharge
debt
legal
demand
compensation
requite
satisfaction
afford
gratification
leave
nothing
desired
atonement
atone
pace
walk
fast
paces
walking
speed
change
step
single
foot
marching
reckoned
heel
stepping
gait
go
steps
quickly
lifting
legs
same
together
amble
rack
tread
echelon
troops
arranged
arrangement
when
left
advance
ladder
climbing
fleet
wedge
v
scaled
overlapping
metal
plates
attached
leather
backing
partially
thin
horny
fish
reptiles
scale
regulate
estimate
according
take
attacking
scaling
ladders
scales
scalelike
structures
removed
color
resemble
truthful
expressing
truth
veracious
reliable
capitalist
conservative
advocate
invests
capital
investment
invested
vegetal
composed
vegetation
plants
asexual
processes
vegetables
vegetable
kingdom
designating
class
vital
phenomena
digestion
absorption
assimilation
secretion
excretion
circulation
generation
turbulence
unstable
flow
liquid
instability
atmosphere
violent
disturbance
disorder
conditions
generally
turbulent
disturbed
tumult
agitation
inquiring
inquiry
inquire
wish
desire
know
investigation
request
information
investigate
causes
curious
worsted
defeat
thoroughly
woolen
fabric
hard
textured
tightly
twisted
yarn
spun
staple
wool
combed
lay
fibers
carpets
hosiery
gloves
fine
soft
untwisted
lightly
knitting
embroidery
gamete
mature
reproductive
cell
unpaired
chromosomes
germ
called
fertilization
o
ö
spore
berate
censure
severely
angrily
chide
vehemently
scold
recorder
making
records
barrister
solicitor
serves
judge
someone
responsible
official
record
writings
transactions
chief
justice
east
indian
settlement
voiding
declare
invalid
room
house
occupants
empty
receptacle
away
ineffective
bodily
discharging
waste
matter
receiving
ejected
voided
appraise
evaluate
ability
consider
comprehensive
way
value
appointed
purpose
conjecture
contrariness
deliberate
stubborn
unruliness
resistance
guidance
fussy
eccentric
contrary
opposition
inconsistency
contrariety
perverseness
obstinacy
buccal
toward
cheek
lying
mouth
oriented
cheeks
spouse
partner
marriage
man
woman
joined
wedlock
married
husband
wife
surge
see
improve
billows
rapidly
sudden
abrupt
strong
increase
forceful
sea
wave
billow
rolling
swell
wind
tapered
windlass
barrel
capstan
cable
surges
slips
slip
let
slacken
suddenly
rope
auk
black
necked
web
footed
diving
bird
northern
seas
wisdom
accumulated
erudition
enlightenment
trait
utilizing
experience
insight
apply
wise
capacity
use
best
ends
means
discernment
judgment
discretion
sagacity
dexterity
judgments
scientific
practical
acquired
tuberculosis
infection
transmitted
inhalation
ingestion
tubercle
bacilli
manifested
fever
lesions
lungs
various
acute
stages
wholeness
robust
health
undivided
unbroken
totality
whole
entire
expressly
intentions
express
salesman
salesperson
sells
occupation
sell
merchandise
zebra
african
wild
horses
remarkable
yellowish
conspicuously
dark
brown
brackish
bands
falconry
training
falcons
pursue
fowl
game
sport
pine
coniferous
tree
languish
droop
longing
pineapple
polygenic
inheritable
character
controlled
once
divest
deprive
status
reduce
cease
hold
possessions
strip
clothes
arms
equipage
dispossess
housework
work
cleaning
housekeeping
kitchen
sweeping
bed
hepatica
moist
mossy
woodland
areas
north
temperate
regions
liverwort
genus
pretty
spring
closely
related
anemone
squirrel
cup
poster
sign
posted
advertisement
kept
inn
post
mail
carriers
rent
travelers
bill
placard
intended
places
posts
bills
courier
marvelous
miracle
extraordinarily
wonder
surprise
astonishing
partaking
supernatural
incredible
defy
fervent
extremely
hot
intense
emotion
glowing
boiling
burning
warm
feeling
ardent
temperament
earnest
fervor
zealous
entomb
grave
tomb
deposit
dead
bury
inter
antisocial
shy
disruptive
standards
destroy
intercourse
averse
society
immorality
accord
morally
objectionable
immoral
vice
cowardliness
courage
cowardice
learner
child
learns
teacher
takes
beliefs
works
learn
trade
scholar
peck
hit
picking
kiss
imperial
dry
2
gallons
fourth
bushel
eight
quarts
deal
excessive
quantity
beak
thrust
pick
against
dig
seize
bite
eat
strokes
quick
deliverance
recovery
preservation
loss
danger
delivering
freeing
restraint
captivity
peril
rescue
delivered
freed
stateliness
elaborate
doing
impressiveness
stately
aphorism
pithy
instructive
saying
maxim
expressed
few
words
sentence
abstract
matters
core
indispensable
center
object
central
miner
underground
working
shift
hebrew
inner
column
wall
boil
fruit
containing
kernels
seeds
essence
mold
shapes
interior
cylinder
tube
casting
hole
through
made
separate
inserted
shaping
extract
cylindrical
sample
boring
poking
poke
abruptly
search
resembling
servile
major
greater
importance
rank
scope
size
elder
boys
family
name
principal
field
study
commissioned
officer
united
air
marines
lieutenant
colonel
captain
university
student
studying
particular
lowest
age
usurious
greatly
exceeding
bounds
reason
moderation
practicing
usury
illegal
exorbitant
interest
council
meeting
consultation
assembly
summoned
convened
deliberation
advice
elected
constitute
advisory
legislative
deliberating
habitus
predisposition
affected
disease
constitution
human
habitude
mode
demented
madness
insanity
insane
mad
unsound
mind
bosom
squeeze
your
chest
secret
thoughts
breast
covers
breasts
them
seat
passions
affections
operations
consciousness
intimate
confidential
familiar
trusted
cherished
beloved
care
cherish
hide
view
muscat
cultivated
grapevines
produce
sweet
grapes
port
gulf
sultanate
varieties
old
world
differing
swollen
false
pride
exaggerated
self
magnitude
intensity
filled
arrogance
anger
expand
abnormally
enlarged
swelling
immoderately
increased
misfeasance
proper
wrongful
injurious
trespass
wrong
overt
improper
might
lawfully
foulness
disgusting
wickedness
foul
dirt
refuse
inanition
weakness
vitality
exhaustion
inane
emptiness
fullness
vessels
either
partial
complete
starvation
digestive
producing
result
horsetail
rushlike
flowerless
herbs
jointed
stems
toothlike
spread
creeping
rhizomes
tend
weedy
hemisphere
africa
south
america
leafless
turkish
denoting
nuptial
wedding
done
bowling
roll
ball
hurl
cricket
pitch
towards
batsman
balls
rolled
objects
aim
knocking
playing
bowls
tenpins
hereafter
future
following
this
subsequent
document
statement
yet
enteric
intestines
alimentary
canal
intestinal
thunder
noisily
heavily
loudly
forcefully
booming
crashing
noise
caused
expanding
path
bolt
lightning
prolonged
loud
follows
flash
report
atmospheric
electricity
rattle
roar
heavy
continuance
denunciation
emit
terror
publish
threat
equivocate
deliberately
ambiguous
unclear
mislead
withhold
equivocal
doubtful
signification
opinions
senses
intent
deceive
expressions
lecher
desires
lewdness
addicted
indulgence
illicit
relations
women
axle
shaft
wheel
rotates
spindle
revolves
transverse
bar
connecting
opposite
wheels
car
carriage
axletree
axis
grimy
ingrained
soot
grime
dirty
cruet
bottle
holds
wine
oil
vinegar
table
vial
glass
pepper
caster
altar
tabulate
cut
flat
enter
tabular
tables
smatter
speak
spotty
amateurish
talk
foolishly
superficially
ignorantly
babble
chatter
smack
gain
acquire
smattering
complot
engage
plotting
conspiracy
swear
confederacy
evil
design
plot
conspire
join
veering
clockwise
turning
aside
shifting
fortunately
fortune
fortunate
luckily
successfully
happily
argument
assertion
evidence
discussion
reasons
advanced
proposition
proposal
play
movie
proof
convince
reasoning
controversy
rational
argumentation
disputation
discourse
artistic
theme
topic
contents
book
chapter
poem
transmission
sending
message
causing
communication
signals
transmitting
includes
gears
gear
changing
mechanism
propeller
deliciousness
delicious
luxury
rapper
performs
rap
music
ornamental
hinge
door
knocker
forcible
oath
lie
musician
specializing
housing
contain
cover
housed
protective
mechanical
component
putting
shelter
dwelling
habitation
shelters
houses
space
solid
insertion
timber
saddle
appendage
trappings
shrinkage
becoming
stealing
display
store
shrinking
contraction
bulk
measurement
lost
grain
castings
decrease
depreciation
tongued
provided
tongue
specified
lick
explore
beater
rouses
hunter
implement
beating
beats
hunters
satinwood
lustrous
oily
wood
cabinetwork
tools
valuable
lemon
colored
fragrant
bind
create
emotional
ties
tie
secure
wrap
enclose
hinders
bonds
confine
cord
band
ligature
chain
fetter
restrain
physical
influence
bandage
dress
contract
grow
cohere
stick
mass
restrained
friction
binds
twining
stem
hop
vine
bine
indurated
clay
much
mixed
oxide
iron
toss
agitate
comes
coin
throwing
palm
lift
tumble
commotion
write
fling
tossed
ocean
jerk
tossing
raising
fils
thousandth
dinar
photosphere
intensely
luminous
sun
sphere
envelope
metaphoric
normally
metaphor
comprising
figurative
tropical
redden
red
embarrassment
shame
blush
misgiving
suggest
doubt
someones
honesty
uneasiness
fitness
painful
expectation
premonition
distrust
apprehension
mislay
cannot
find
ascribe
source
misplace
noisy
disorderly
outburst
confused
popular
riot
perturbation
excitement
universally
everywhere
universal
exception
concurrent
occurring
operating
acting
conjunction
agreeing
opinion
contributing
co
perating
conjoined
associate
concomitant
happening
cognizance
similar
questions
contributory
pursuing
seeking
rival
opponent
supernumerary
days
year
fifty
weeks
sublimate
pure
urges
activities
subtle
remove
impurities
concentration
distillation
product
vaporization
vapor
cooling
returns
refine
exalt
heighten
elevate
biological
drives
socially
acceptable
constructive
obtained
sublimation
also
purified
brought
condensed
inspirational
imparting
divine
soul
inspiration
{
}
feeding
supplying
nourishment
consuming
eating
eaten
furnishes
affords
pasture
land
beings
members
citizens
compose
tribe
nation
race
aggregate
individuals
forming
indefinite
population
distinguished
special
populace
vulgar
crowd
populate
unspotted
soil
spot
stain
spotted
free
unblemished
immaculate
trivium
introductory
curriculum
medieval
grammar
logic
rhetoric
triple
eloquence
“
”
arts
raiment
decorative
vesture
garments
vogue
current
acceptance
fashion
custom
reception
inhumanity
compassion
consideration
atrocious
cruelty
inhuman
inhumane
barbarity
utensil
household
domestic
farming
philippic
declamation
abounding
acrimonious
invective
nightly
night
day
horizontal
horizon
base
horizontally
near
level
contained
chatelaine
mistress
chateau
waist
carrying
purse
bunch
keys
domino
hooded
cloak
half
mask
masquerade
costume
upper
holes
eyes
rectangular
block
dominoes
bear
0
6
dots
hood
canons
cathedral
mourning
veil
buzzer
buzzing
push
button
outer
gives
ringing
signal
pushed
whisperer
diffused
broad
subjected
scattering
reflection
translucent
diffuse
widely
abroad
dispersed
flowing
unessential
fundamental
essential
prime
unimportant
constituting
absolute
necessity
sustainment
sustaining
providing
subsistence
maintenance
ergot
alkaloids
acid
diseased
rye
cereals
grains
spur
mycelium
spawn
fungus
infecting
wheat
stub
horn
chestnut
situated
behind
pastern
episode
distinctive
brief
section
dramatic
broadcast
serial
incident
story
introduced
variety
incidental
narrative
digression
separable
naturally
flocculent
fluffy
clothed
flocks
flakes
woolly
down
newly
hatched
unfledged
birds
sparkling
wines
waters
charged
artificially
carbon
dioxide
shining
brilliant
brightly
lively
exhibit
virtuosity
sparks
rapid
brightness
spark
emitting
glittering
flashing
immoderate
exceeds
excessively
hose
mans
close
fitting
garment
16th
17th
reaching
doublet
flexible
pipe
conveying
socks
stockings
tights
include
underwear
trousers
breeches
knee
feet
stocking
india
rubber
fluids
faucet
hydrant
engine
wheeled
directions
revolving
pivot
somebody
adolescent
13
19
maturity
puberty
juvenile
onset
growing
advancing
childhood
youth
henchman
assists
attendant
servant
thankless
gratitude
likely
acknowledging
thankfulness
ungrateful
obtaining
thanks
unacceptable
resistant
political
views
favoring
conservatism
avoiding
excess
reluctant
accept
changes
ideas
preserve
safe
injury
preservative
institutions
opposed
innovation
preserves
ruin
radical
preserver
customs
moderate
freshness
fresh
originality
virtue
novel
alert
perceive
aware
conscious
obtain
receive
impressions
organs
identity
hear
feel
apprehend
convinced
intuition
note
remark
discern
obtainable
rapturous
rapture
delight
ecstatic
transporting
ravishing
manifesting
coneflower
perennials
eastern
stalked
showy
drooping
conelike
us
extern
nonresident
doctor
medical
hospital
there
pupil
seminary
lives
walls
emphatically
authoritatively
firmly
communicate
manifest
explicitly
plainly
proclaim
announce
declaration
assert
affirm
avow
open
explicit
avowal
plaintiff
say
yes
strengthen
facts
confirm
decree
appellate
court
review
positively
tell
confidence
aver
judicial
sanction
solemn
magistrate
tribunal
penalties
perjury
testify
affirmation
synchronization
occur
recur
unison
exists
concurrence
wrestler
combatant
tries
ground
skillful
wrestling
latticework
framework
strips
lattice
n
continence
constraint
voluntary
urinary
fecal
command
imposes
refraining
appetite
unlawful
pomology
botany
studies
cultivates
fruits
science
treatise
cultivation
dejection
melancholy
depression
excretory
evacuated
bowels
humbling
abasing
lowness
spirits
occasioned
grief
misfortune
mental
excrement
deviltry
wicked
cruel
reckless
malicious
discomfort
annoyance
diabolical
malignant
mischief
devilry
heal
get
healthy
cure
hale
wound
derangement
soundness
subdue
pass
original
purity
integrity
ocher
orange
yellow
silica
alumina
ferric
pigment
metallic
earthy
illegitimate
marriages
offspring
lawful
forbidden
unlawfully
begotten
born
bastard
legitimately
deduced
inferred
illogical
prove
bastardize
pirouette
spin
toes
ballet
whirling
dancing
whirl
dancer
inverse
reversed
turned
backward
inverted
sequence
reciprocal
attachment
reverse
sill
structural
continuous
supporting
structure
igneous
layers
older
sedimentary
basis
foundation
frame
supports
stone
threshold
window
stands
young
herring
obvious
easily
perceived
grasped
discovered
seen
understood
readily
eye
intellect
plain
evident
apparent
gelatinous
gelatin
consistence
viscous
month
approximately
30
twelve
calendar
portions
bomb
bombs
fail
passing
grade
explosive
fused
explode
sealed
combustion
badly
totally
ineffectual
shell
spherical
those
fired
mortars
sis
female
tetravalent
nonmetallic
oxygen
abundant
occurs
feldspar
granite
quartz
sand
semiconductor
transistors
colloquial
abbreviation
hardtack
former
ships
mahogany
soldiers
sailors
unleavened
biscuit
scrimp
meager
allowance
limit
straiten
scant
shorten
scanty
pinching
miser
niggard
ladylike
befitting
breeding
lady
manners
bred
feeble
effeminate
spiritualistic
spiritualism
rambler
walks
rover
wanderer
emaciation
leanness
lean
fisher
american
arboreal
carnivorous
mammal
fishes
animal
weasel
cat
protect
vary
darkness
intercepted
opaque
differs
protects
sunlight
comparative
obscurity
owing
interception
interruption
intervention
contemplated
obscure
exposed
secluded
retreat
screen
intercepting
illumination
dim
teething
teeth
baby
eruption
gums
first
attending
issue
dentition
dialyze
dialysis
membrane
aslant
slanted
across
slanting
angle
obliquely
athwart
indoctrination
teaching
doctrines
uncritically
instruction
rudiments
principles
system
liquefy
heating
fluid
heated
convert
melt
dissolve
technically
sole
agency
gaseous
posture
behave
affectedly
unnaturally
impress
limbs
bearing
figure
regard
attitude
whether
external
circumstances
internal
mood
reference
contort
acrobat
contortionist
pose
assume
degenerative
gradual
deterioration
cells
undergoing
degeneration
degenerate
scalawag
deceitful
unreliable
scoundrel
playfully
scamp
declared
indicate
symbol
settled
recurring
occasional
binding
injured
fillet
woven
dressing
wounds
bound
compress
antibody
proteins
response
antigen
neutralizes
thus
immune
bodies
blood
antagonism
harmful
foreign
bacteria
threaten
punishment
threatened
me
i
tried
call
threats
menace
inspire
alarm
attempt
promise
disagreeable
warn
unpleasant
approaching
impending
conditional
infliction
threatening
hummock
hill
knoll
hillock
ridge
pile
ice
ethylene
flammable
colorless
alkene
petroleum
manufacturing
many
chemicals
anesthetic
backgammon
board
players
pieces
throws
dice
chance
played
twenty
four
spaces
appointment
non
elective
furnishings
hotel
job
you
hope
appointing
designation
office
trust
station
stipulation
agreement
fixing
mutual
engagement
dependence
relying
else
tolerant
dependent
psychologically
physically
habit
alcohol
narcotic
drugs
depending
hanging
suspension
influenced
subjection
concatenation
systematic
emerge
concealment
interview
discuss
formally
evaluation
journalists
conference
sight
formal
conversation
questioning
eliciting
publication
purulent
pus
attended
suppuration
lexicon
alphabetical
list
vocabulary
definition
dictionary
greek
latin
impeccable
sin
error
liable
exempt
possibility
drumhead
performed
speedily
formality
stretched
taut
drum
parchment
skin
pierced
sockets
perfidy
betrayal
violating
faith
allegiance
faithlessness
treachery
formulary
prescribed
ritual
model
snot
nasal
mucus
regarded
arrogant
annoying
secreted
discharged
nose
mean
insignificant
fellow
wipe
travel
excel
contains
brains
poll
uppermost
foremost
inanimate
larger
thicker
heavier
distinction
thinner
edge
closes
lead
leader
lop
originate
river
suspensory
suspended
fitted
suspend
suspending
suspends
truss
bag
scrotum
contradictory
propositions
both
unable
affirming
implying
denial
asserted
inconsistent
opposing
repugnant
denies
opposes
perceptible
intelligible
manipulate
hands
skillfully
advantage
management
fraudulently
dexterous
instruments
mesmeric
awfully
terrible
awful
awe
reverently
masher
aggressive
amorous
advances
brewing
machine
mash
charmer
descant
sing
register
yodeling
musical
accompaniment
improvised
added
melody
iginally
double
song
counterpoint
sung
tenor
variation
treble
accomplishment
comment
particularity
laver
edible
seaweeds
seaweed
crinkly
fronds
washing
basin
brazen
placed
jewish
tabernacle
officiating
priests
washed
impersonation
imitating
mannerisms
comic
pretending
personification
personality
reprobate
deviating
reject
documents
abandon
eternal
damnation
disapproval
scruples
abandoned
depraved
disapprove
detestation
marks
dislike
condemn
unworthy
disallow
pardon
hydration
reversible
hydrate
coop
farm
building
poultry
enclosure
wire
bars
inclosure
pen
grated
box
confining
shut
compass
cramp
lapse
least
drop
morals
intermission
occurrence
inattention
higher
gliding
slipping
falling
imperceptible
rectitude
termination
privilege
neglect
limited
contingency
devolution
downward
glide
slide
deviate
commit
inadvertence
proprietor
destination
omission
negligence
patron
legatee
permit
devolve
allow
inevitable
incapable
avoided
prevented
unavoidable
shunned
irresistible
treason
disloyalty
subversive
attempting
overthrow
offender
owes
loosely
asphyxia
choking
electric
poison
animation
phosphine
fishy
smell
pesticide
rumple
crumpled
creased
disturb
smoothness
gather
folds
uneven
irregular
inequalities
crumple
fold
plait
unalloyed
admixture
alloyed
reduced
unmixed
unqualified
frosty
frost
devoid
warmth
cordiality
expressive
unfriendliness
disdain
congeal
freezing
chill
affection
diffusive
spreading
diffusion
diffusing
copious
episodic
narration
appearing
duration
adventitious
blacking
shiny
footwear
preparation
worse
minor
inadvertent
observed
accidents
memory
lapses
bounding
footing
fly
shoot
convey
gently
omit
unintentional
twig
separated
stock
scion
descendant
industrious
perseverance
promote
enterprise
diligence
constantly
busy
assiduous
slothful
idle
active
pursuit
emulsify
emulsion
milky
fat
globules
finely
semblance
solution
illusive
based
illusion
deceiving
deceptive
illusory
unreal
understandingly
comprehension
intelligently
determine
activity
burden
imposed
levied
defray
expenses
exact
assess
fix
judicially
accuse
jaunt
trip
pleasure
journey
ramble
here
stroll
excursion
refreshment
evilness
malignity
vileness
eyeless
blind
traction
pulling
bone
limb
relieve
pressure
healing
moves
automobile
tire
road
drawing
motive
towing
boat
tug
adhesive
rail
pulley
springer
arch
--
springs
cow
birth
spaniel
wavy
silky
coat
liver
impost
rests
seems
bottom
lies
nineteen
eighteen
nine
ten
claw
seizing
digging
clutch
panic
scratch
scrape
pull
claws
nails
curved
toe
mammals
grasping
crustacean
arthropods
hooked
nail
beast
armed
pinchers
lobster
crab
tear
undervalue
assign
low
esteem
real
depreciate
estimation
despise
price
undervaluation
polymerize
undergo
polymerization
molecular
weight
atomic
proportions
ownership
owner
possessed
possession
controlling
exclusive
title
proprietorship
stinginess
unwillingness
stingy
adequate
concept
constant
variable
how
quantify
conception
constituent
qualities
attributes
syllable
determines
pronounced
rathskeller
tavern
street
featuring
beer
originally
german
restaurant
basement
hall
saloon
drinks
served
simple
had
marsupial
marsupials
pouch
immature
composition
musicians
yourself
behaves
conducting
generalship
guiding
deportment
escort
attend
commander
conductor
florin
100
cents
netherlands
austria
36
slam
violently
winning
tricks
bridge
impact
bang
opponents
cards
swing
crotchet
curve
crook
hook
quarter
forked
crotch
indentation
traverse
pledge
contribution
charity
guarantee
security
accepted
membership
fully
admitted
drink
honor
debtor
creditor
created
deposited
bailment
pawn
bail
surety
plight
frizz
tight
run
naked
spots
blotches
shades
stained
stripe
vein
strake
powder
yielded
mineral
scratched
rubbed
harder
distinguishing
streaks
stripes
variegate
colors
swiftly
spearfish
worldwide
rare
powerful
swordfish
ventral
fins
carp
sucker
experiencing
severe
90
degrees
demonstrating
recognize
draw
distinctions
critical
consequence
vowel
pronunciation
ending
perceiving
using
minute
penetrating
clever
shrewd
sensibility
susceptible
keenly
keen
incriminatory
charging
suggestive
guilt
incriminate
efficacy
operation
agent
production
honey
bees
endearment
viscid
collected
honeycomb
fondly
obsequiously
courteous
complimentary
fawn
accumulative
increasing
successive
addition
accumulation
collect
amass
cumulative
pathetic
inspiring
contempt
pity
scornful
inciting
affecting
emotions
pathos
incorporate
merge
already
incorporeal
spiritual
incorporated
corporate
combined
embodied
combine
ingredients
consistent
embody
introduce
blended
shown
diagrams
diagram
renew
improved
perfection
vigor
rejuvenate
recreate
rebuild
substitute
obligation
begin
recommence
pillory
expose
ridicule
scorn
criticize
offenders
locked
adjustable
boards
erected
solidity
consistency
density
fluidity
compactness
openness
hollowness
strength
primary
exclude
resist
hardness
massiveness
firmness
validity
certainty
inclosed
vicariate
institution
vicar
delegated
vicarious
oversight
router
tool
cutter
carpentry
grooves
protruding
smoothing
cavity
blatant
completely
offensively
vehement
outcry
bellowing
calf
disagreeably
clamorous
sounding
tune
better
functioning
pitches
notes
accurately
radio
receiver
frequency
rhythmical
melodious
tones
voices
harmony
sounds
intonation
harmonious
harmonize
itself
adapted
correct
attune
adapt
accordant
rancor
bitter
deepest
spite
seated
enmity
malice
inveterate
hatred
minim
smallest
ordinal
thousand
counting
1
000
last
tenth
hundredth
fatally
fatal
consequences
proceeding
fate
issuing
mortally
destructively
aerator
exposing
sewage
soda
accomplish
success
perform
execute
fulfill
equip
furnish
acquirements
accomplished
polish
grab
grasp
gripping
gripe
snatch
seizure
efface
inconspicuous
recognition
rubbing
erasing
disappear
inscribed
striking
erase
illegible
indiscernible
impression
wear
stratagem
maneuver
scheme
contrived
evade
artifice
trick
war
machination
righteousness
adhering
righteous
uprightness
subservience
abject
cringing
submissiveness
instrumental
serve
purposes
derogatory
servility
fomenter
agitates
foments
encourages
coarseness
coarser
looseness
roughness
texture
vulgarity
grossness
rigid
airship
dirigible
unyielding
bending
compromise
flexibility
adapting
firm
pliant
lax
indulgent
inflexible
strict
environs
extend
simultaneously
encircle
adjacent
surround
neighborhood
suburbs
hideous
grossly
morality
horror
ugly
terrifying
frightful
shocking
behold
distressing
ear
dismay
hateful
personally
environment
usher
insert
announcement
recommendation
polytheistic
polytheism
professing
advocating
downfall
reputation
rain
snow
hail
sleet
mist
decline
descent
happiness
destruction
discard
cast
discarded
useless
card
follow
suit
getting
rid
superfluous
longer
dismiss
employment
favor
whoredom
offering
sex
fornication
idolatry
perplex
mystery
bewildering
complicated
involve
entangle
intricate
unraveled
embarrass
puzzle
distract
bewilder
confuse
trouble
ambiguity
suspense
anxiety
plague
vex
bigotry
intolerance
prejudice
bigot
obstinate
unreasoning
minded
tenets
blankly
expression
blank
directly
flatly
variance
moment
expected
square
deviations
random
dispensation
regulation
typically
departs
variant
difference
produces
dispute
disagreement
dissension
discord
quarrel
effectual
ought
agree
writ
allegation
hydrated
crystallization
balance
add
moisture
shoes
fit
ankle
plastic
case
dealt
u
plate
nailed
underside
hoof
lighter
rim
defend
steel
fastened
runner
sleigh
vehicle
slides
bicycle
moved
pedals
mercantile
profit
merchants
buying
selling
commodities
commercial
physiologically
physiological
physiology
tit
fleshy
milk
secreting
glandular
projection
mammary
gland
insectivorous
morsel
bit
cropper
farmers
tenants
crops
pigeon
crop
pouter
shearing
bolts
rod
facing
snappish
apt
irritably
snap
eager
reply
provoked
tart
peevish
seem
exist
aspect
look
fancy
mandate
mandatory
surrendered
turkey
germany
tutelage
european
able
themselves
commission
policies
electoral
victory
authoritative
authorization
injunction
precept
policy
electorate
representatives
lintel
beam
finishing
opening
resisting
crosswise
calmly
stress
sedate
calm
apocryphal
questionable
authenticity
canonical
mythic
fictitious
spurious
belly
primate
nearest
organ
organism
abdominal
petal
moss
misshapen
infuriated
furious
enraged
saucily
impudent
impertinent
saucy
impudently
boldness
descendent
heir
sprout
grafting
deriving
ways
built
christianity
judaism
islam
races
nations
heathen
pagan
linguistic
spellbound
canteen
flask
items
personnel
school
camp
outside
policemen
culinary
officers
garrison
shop
petiole
blade
leaf
stalk
peduncle
pixy
shrub
fairies
english
fairy
elf
prideful
superiority
joyful
proud
because
triumph
haughty
placidity
calmness
quiet
undisturbed
placid
serenity
objectify
objective
impersonal
represent
magnesite
magnesium
carbonate
compact
granular
masses
crystals
crosspiece
brace
extends
framed
ambiguously
meaning
lag
hang
coins
lagging
slowing
period
slats
bucket
fag
rump
valve
steam
closing
stave
cask
lags
transported
transport
chapeau
headdress
brim
primitively
origin
beginning
primitive
primarily
pertinence
relevance
applicable
pertinent
justness
suitableness
vim
vigorous
imaginative
spirit
loser
contestant
loses
contest
gambler
bet
consistently
unsuccessful
endeavor
relationships
strategy
unlikely
succeed
mow
mower
sad
lip
loft
barn
hay
stored
wry
mouths
mew
gull
grass
scythe
rows
mowing
heap
sheaves
stowed
sheaf
stow
prim
dainty
exaggeratedly
lips
primly
privet
precise
neat
deck
nicety
sorceress
sorcerer
written
printed
void
bullet
baseball
ready
cartridge
pale
printing
paper
interval
lot
gained
ticket
lottery
prize
indicated
unwritten
bland
fidget
continual
uneasily
fits
starts
restlessness
nervous
incessant
dysphoria
gullible
tricked
trusting
naive
deceived
gash
trench
furrow
was
erosion
excavation
incision
flesh
midnight
middle
substructure
groundwork
hardly
almost
difficulty
unwillingly
grudgingly
scarcely
barely
quite
wholly
frequenter
frequently
encountered
customer
frequents
visits
resorts
customarily
warrantee
recipient
warrant
issued
whom
assurance
specifications
warranty
betrayer
reveals
says
does
betrays
reticent
attention
cool
inclined
silent
reserved
uncommunicative
gathering
assemble
assembling
collecting
bringing
congregation
charitable
collection
sepia
tinge
cuttlefish
numerous
starry
adorned
stellar
tan
skins
hides
tannic
browning
exposure
topaz
ratio
angled
triangle
bark
oak
bruised
broken
mill
tanning
imparted
steeping
infusion
whereby
impregnated
tannin
),
durable
impervious
thrash
beat
flog
switch
tanned
pellucid
clarity
transparently
understandable
transparent
limpid
forehanded
timely
seasonable
beforehand
needs
resources
necessities
easy
forehand
fore
rheumy
damp
wet
rheum
taught
commandment
respecting
lyceum
students
intermediate
elementary
college
grades
9
12
athens
aristotle
philosophy
reiteration
repeating
instance
thereof
tragedian
actor
specializes
tragic
roles
writer
tragedy
player
initial
initials
letter
word
marking
commencement
incipient
commencing
subsidy
grant
paid
benefits
aid
peration
extraordinary
sovereign
friendly
purchase
neutrality
municipal
private
assist
establishment
deemed
advantageous
subvention
titanium
grey
corrosion
lightweight
alloys
airplane
sources
rutile
ilmenite
holographic
entirely
handwriting
signer
holograph
holography
labored
requiring
strive
reach
efforts
childbirth
labor
elaborately
wrought
require
transcendent
surpassing
limits
beyond
ordinary
excellent
mishap
unpredictable
outcome
unfortunate
accident
luck
mischance
tiger
fierce
audacious
feline
forests
asia
tawny
carnivore
southern
indies
ferocious
bloodthirsty
livery
rides
favored
accompanied
boding
suffers
prosperous
unlucky
unhappy
impossible
overpowering
resisted
sorry
regret
sorrow
undone
grieved
pained
dismal
gloomy
mournful
poor
worthless
iota
alphabet
detectable
jot
particle
condemning
disapprobation
adverse
prudent
sensible
sagacious
circumspect
practically
judicious
discreet
dictated
directed
prudence
forethought
evincing
frugal
economical
extravagant
convivial
fond
pleasures
feast
entertainment
drinking
accompanying
festivity
festive
gay
jovial
spoon
snuggle
faces
cutlery
shallow
bowl
container
stir
oval
preparing
simpleton
croquet
golf
demonstrative
foolish
love
commutator
reversing
electrical
machines
alternating
currents
shawl
oblong
shoulders
cotton
silk
textile
neck
effusion
unrestrained
pouring
poured
literally
escape
rupture
exudation
scrod
atlantic
cod
haddock
split
boned
cooking
weighing
pounds
pollock
broiled
codfish
dressed
fossilize
fossil
mentally
petrify
antiquated
fossilization
mummify
deaden
excavator
excavating
dredging
home
committed
sent
assent
admission
notion
embrace
tradition
credence
bat
foment
try
lotion
bathe
sponge
medicated
nurse
abet
instigate
fomentation
excitation
querulous
complaining
murmur
complaint
fretful
whining
chevron
sleeve
badge
honorable
ordinaries
width
respectively
dexter
sinister
bases
elbow
flue
conduit
smoke
bladelike
arm
anchor
fissure
compartment
division
chimney
flame
gases
surrounding
boiler
rises
fur
lint
feature
ostentatious
prominent
chin
film
program
theater
lineament
landscape
picture
treaty
essay
peculiarity
ritualism
magical
rites
ceremonies
emphasis
ritualistic
worship
founded
adherence
observance
slap
paddle
smacking
instantly
unusually
darkened
clouds
villain
burdened
plays
villainous
role
heaves
weighty
ponderous
burdensome
oppressive
endure
grievous
afflictive
laden
bowed
actual
disappointment
molder
molds
founding
skilled
crumble
dust
decay
separation
presence
plunder
steal
spoils
illegally
pillage
spoil
sack
rob
forcibly
plundering
pillaging
robbery
booty
theft
fraud
tare
railroad
aircraft
fuel
cargo
tore
weed
grows
among
leguminous
vicia
sativa
grown
fodder
abatement
seller
buyer
account
lethargy
comatose
torpor
found
sleeping
sickness
inactivity
morbid
drowsiness
inaction
indifference
bonbon
candy
nuts
coated
chocolate
sugar
confectionery
sugarplum
mirror
polished
images
reflecting
faithful
depiction
looking
speculum
image
exemplar
copy
duplicate
mimic
imitate
resemblance
thresh
flail
ironing
press
linens
advent
arrival
awaited
season
sundays
preceding
christmas
reappearance
jesus
christ
approach
separatist
entity
secession
national
withdraws
separates
himself
belonged
dissenter
nonconformist
schismatic
sectary
boisterous
exuberant
agitated
exhibiting
tumultuous
violence
fury
stormy
derrick
drill
tubes
lowered
barroom
alcoholic
counter
liquors
hullabaloo
protest
uproar
spontaneous
said
planned
proneness
readiness
tendency
impulse
planted
sphinx
inscrutable
keeps
statues
lion
egyptians
egyptian
porphyry
ram
hawk
wingless
mythology
she
monster
winged
enigmatical
diplomacy
artist
creates
sculptures
carve
sculpture
designs
finished
marble
bronze
conformable
comply
willing
corresponding
compliance
submissive
compliant
silo
tower
storing
installation
ballistic
missiles
pit
vat
packing
winter
delegation
regional
declining
effective
transference
colossal
elicit
enormous
gigantic
huge
tracer
investigator
missing
radioactive
isotope
metabolism
traces
railway
tracing
searching
articles
packages
freight
cars
transportation
article
package
countryman
inhabitant
compatriot
dwells
townsman
rustic
husbandman
farmer
retrench
tighten
belt
carefully
pare
lessen
abridge
curtail
restrict
suffer
retrenchment
bigger
wider
extending
wide
occupy
dilate
distend
enlarge
develop
opened
dilated
distended
masturbation
manual
stimulation
genital
onanism
puppet
doll
manipulated
fingers
dishonest
tasks
mock
drama
marionette
wooden
contribute
raise
animate
incite
help
forward
diluted
effectiveness
fence
ruddy
dusky
pallid
wan
bright
luster
hue
diminish
stake
slat
fencing
inclosing
picket
incloses
fences
boundary
palisade
inclose
pales
encompass
swift
velocity
fleetly
liberalize
laws
prejudices
potentate
ruler
unconstrained
potent
possesses
sway
prince
monarch
chaser
immediately
trying
overtake
capture
chases
pursuer
driver
engraves
screw
threads
lathe
performer
entertainer
audience
accomplishes
fulfills
shows
peopled
furnished
inhabited
bearish
expecting
prices
temper
fearful
anticipating
market
daisy
composite
heads
ray
whorl
notary
shorthand
innuendo
indirect
implication
hint
remote
allusion
named
insinuation
averment
pleading
application
otherwise
unintelligible
interpretative
parenthesis
thrown
quoted
explain
sky
anticipated
layer
stratum
subsoil
cross
visible
spectator
junction
tangent
coursing
liquids
dogs
scent
unknown
famous
acclaimed
values
solutions
equation
anyone
belong
apprehended
heterogeneous
originating
unlike
dissimilar
freighter
forwarding
recreational
medicines
commodity
salable
sale
stuff
dyeing
chemical
prescribe
affect
dose
phrenology
functions
brain
supposed
faculties
usage
hypothesis
gall
traits
skull
parted
margin
incised
lobes
discontinue
association
midrib
wright
repairs
artificer
workman
manufacturer
mechanic
diagnostic
concerned
diagnosis
indicative
furnishing
symptom
lore
anecdote
anterior
insects
books
counsel
oration
oratory
treating
dignified
occasion
funeral
anniversary
celebration
drover
herd
cattle
sheep
guise
simulated
mien
garb
equivocation
intentionally
vague
falsification
cleverly
avoids
disbelief
rejection
disbelieving
persuaded
refusal
credit
congest
obstructed
accumulate
overfullness
capillaries
superlative
highest
praise
attainable
stage
lifted
eminent
utmost
disillusion
enchantment
illusions
therefrom
forwardness
assertiveness
prompt
cheerful
advancement
eagerness
ardor
mixer
club
juice
mix
electronic
mixes
input
output
mixing
foods
dance
smoky
tasting
quantities
combustible
profitable
bend
rely
inclining
conform
rest
comfort
deficient
slim
plump
lank
richness
sufficiency
productiveness
barren
principally
muscle
ellipse
closed
intersection
cone
bounded
corresponds
elliptical
orbit
planet
saponification
reaction
ester
alkali
alkaline
hydrolysis
soap
conversion
effacement
withdrawing
background
quadruple
components
fourfold
multiply
twice
multiplied
homeless
nationality
citizenship
unfortunately
commune
intimately
heightened
receptivity
communion
catholic
district
countries
families
sharing
everything
converse
interchange
sentiments
feelings
partake
eucharist
lord
supper
friends
territorial
france
mayor
inhabitants
owning
income
aspects
daily
moth
crepuscular
nocturnal
insect
stout
feathery
hairlike
antennae
lepidopterous
included
butterflies
feeds
vagrancy
wandering
livelihood
vagrant
unsettled
billiard
billiards
buffoon
rude
fool
amuses
ridiculous
amusing
antic
gestures
droll
harlequin
clown
merry
andrew
buffoonery
ouster
dispossession
ejecting
forcing
expulsion
ejection
tawdry
tastelessly
cheap
shoddy
elegance
ornaments
gaudy
potency
contact
mince
harsh
daintily
chopped
bits
chop
hash
suppress
weaken
extenuate
palliate
frankly
clip
delicacy
linger
proceed
loiter
remain
wait
parting
deciding
hesitate
spend
lingering
hammock
canvas
netting
swings
consummate
perfect
necessary
qualification
informally
pejorative
sexually
completion
finish
tremolo
tremulous
repetition
alternation
cessation
contrivance
pulses
hyperbolically
hyperbola
exaggeration
grammatical
speakers
grammatically
jeer
laugh
derision
tackle
sarcastic
reflections
mockery
taunting
scoff
taunt
flout
railing
biting
jest
jibe
appealing
attract
earnestly
ask
protection
appeals
imploring
emasculate
unsuitable
feminine
testicles
male
virile
procreative
castrate
geld
vitiate
unmanly
softness
deprived
virility
unmanned
weak
chemistry
sciences
dealing
properties
reactions
relate
treats
alterations
molecules
depend
variations
atoms
theory
catch
lasso
inch
circumference
strands
braided
row
string
braiding
thread
glutinous
polymorphous
compound
individual
independent
differences
assuming
styles
leadership
upland
hilly
elevated
mountainous
banks
rivers
hills
uplands
spadix
spike
surrounded
spathe
nautilus
modification
posterior
tentacles
norm
abnormal
average
performing
analogical
perpendicular
damper
movable
regulates
draft
stove
furnace
decreases
amplitude
acoustical
aerodynamic
oscillations
depressing
pianoforte
vibrations
check
roundabout
obliqueness
indirection
traffic
streams
circularly
island
rotating
seats
ride
amusement
circuitous
going
encircling
enveloping
jacket
scene
vicissitude
inhabits
resides
transient
lodger
visitor
parish
resident
multiplier
multiplying
donor
tissue
host
confers
gratuitously
benefactor
grants
estate
later
converted
suavity
ingratiating
agreeableness
pleasantness
gentleness
urbanity
myth
told
traditional
stories
factual
historical
myths
fabulous
imaginary
fanciful
deplore
strongly
poignant
bewail
lament
mourn
perfunctorily
perfunctory
carelessly
designate
identifying
term
heading
names
statute
deals
descriptive
inscription
author
publisher
date
panel
entitle
lactic
sour
whey
procured
eyelet
edges
fastener
ring
cords
perforation
sails
grommet
fasten
cormorant
voracious
seabird
shag
eater
glutton
gluttonous
wallet
pocket
papers
necessaries
beggar
peddler
pack
pocketbook
areola
veins
wing
nipple
inflamed
pimple
interstice
cracks
crustaceous
lichens
composing
gans
interlace
vesicle
pustule
prevail
valid
overcome
predominant
currency
prevalence
persuade
immodest
offending
modest
reserve
decorum
indecent
indelicate
obscene
lewd
predetermine
biased
doom
previous
prowess
observation
bravery
valor
gallantry
intrepidity
ultimate
designated
finding
location
destined
predetermined
aimed
docility
agreeably
manageable
riddance
removing
preaching
deliver
sermon
plead
argue
irreducible
simpler
restoration
globular
globe
chromatin
mitotic
ranking
bullhead
freshwater
sculpin
flattened
bony
plated
hornlike
spines
marine
cobalt
silver
bivalent
trivalent
trace
nutrition
tough
reddish
fusible
magnetic
crude
arsenic
saddler
maker
harp
seal
fringed
scalloped
jolts
movements
finesse
perfected
prepare
preliminary
sketchy
bordering
uncut
bully
rowdy
rudely
roughen
betrothal
marry
betrothed
boxer
fights
fists
stocky
medium
sized
haired
dog
brindled
jawed
muzzle
containers
packs
boxes
pugilist
hydroplane
planes
projecting
hull
submarine
depressed
ahead
sink
ë
crochet
looping
crocheting
needlework
interlocking
needle
looped
stitches
unreasonable
reasonable
irrational
concise
explanation
phrase
defining
determination
ascertaining
explaining
description
enunciation
constituents
logical
leaded
somewhere
residue
leads
page
clearing
obstructions
tract
wooded
suspicion
cleared
landholder
holder
chard
beet
root
stalks
succulent
whitish
leafstalks
artichoke
3
dimensional
publications
sheets
tome
extended
convolution
coil
cubic
inches
yards
incandescence
phenomenon
emission
temperature
whiteness
implant
triangular
usable
tapering
splitting
rocks
five
trapezoidal
rive
interrupted
intermittently
stopping
starting
peace
tranquility
interfere
elses
intermitted
stopped
neckerchief
kerchief
multilateral
poetic
poetry
poets
